app/controllers/search_controller.rb

SELECT "search_data".* FROM "search_data"
---
def index
  @results = SearchData.all